// Cтворити функцію, яка створює та реєструє нові команду у автопробізі. Під час виклику функції потрібно передати дані про команду - назва команди, ім'я водія, рік народження водія, марка автомобіля. спонсор команди та чи водій допущений до автопробігу


// Запитати у користувача дані (через prompt та циклічно), про нового користувача у системі та зберегти його в об'єкт. Дані про користувача - логін, пароль, місто, країна, стать, вік

const bert = prompt("Напишите свой логин, пароль, город");
console.log('your dsta =', bert)

const userData = {
    
}
console.log(userData);

//userData = bert;
    



// Створити функцію, яка буде міняти дані в конкретного користувача. Наприклад сhangeUserData(user_1, city, 'Kherson). Де user_1 - обʼєкт в якому буде мінятись, city - поле, як буде мінятися на нове значення поля city - 'Kherson'

// Створити об'єкт cтудента - name, surname, age, course, city, greeting, addHomework.  +
// greetin - метод, котрий виводить повідомлення через console.log('Hi. everyone!'). addHomework - метод, котрий виводить повідомлення через console.log('Sending my howework... Please, wait') ???

/*
const student = {
    name: "Olya",
    surname: "Semenenko",
    age: 24,
    course: 4,
    city: "Kharkiv",
    greeting: 'Hi student!',
    addHomework: 'I will send soon, please wait',
}
console.log(student); */



// Cтворити функцію isEmpty, яка повертає true, якщо об’єкт не має властивостей (порожній), інакше false.


// Створити об’єкт для зберігання виручки команди продавців, наприкла: {Taras: 2000, Marta: 10 Ivan: 1200, Petro: 400, Roma: 366, Alina: 829} ??

/*
const salary = {
    Taras: 3000,
    Olha: 900,
    Mariya: 1500,
    Alina: 600,
    Oleh: 3210,
    Petro: 899,
    
}
console.log(salary);
*/


// Створити фукнцію, яка працює з цим обʼєктом та обчислює суму всіх виручок та виводить результат через сonsole.log

/*
function totalAmount () {

}
*/

// Створити фукнцію, яка працює з цим обʼєктом та яка знаходить продавця з найменшою виручкою та виводить результат через сonsole.log у зрозумілому форматі

// Створити фукнцію, яка знаходить продавця з найбільшою виручкою та виводить результат через сonsole.log у зрозумілому форматі

// Створити фукнцію, яка випадковим чином вибирає продавця місяця та виводить привітання цьому працівнику через сonsole.log у зрозумілому форматі

